// pages/pointsRule/pointsRule.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    ruleDes: "1. 新购买研习卡获得初始研值100分，新购买研学卡初始研值500分。\n2. 介绍他人购买研习卡获得研值50分，购买研学卡获得研值250分。\n3. 协助研习院活动筹备获得研值10-50分，当选研习院活动参与嘉宾获得研值100分，当选主分享嘉宾获得200分。\n4. 活动签到获得研值20分，活动中积极互动、发言获得10-50分，活动后分享感受获得20分，活动后精彩分享获得30分。\n5. 转发研习院相关内容获得研值10分。 \n6. 为研习院介绍活动类资源获得研值100-300分。 \n7. 为同学会嫁接福利类资源获得研值100-300分。"
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})